export const dataList = {
        gua: {
            m: "地风升",
            y: "升：元亨，用见大人，勿恤，南征吉。",
            t: "《彖》曰：柔以时升，巽而顺，刚中而应，是以大亨。用见大人勿恤，有庆也。南征吉，志行也。",
            x: "《象》曰：地中生木，升；君子以顺德，积小以高大。"
        },
        yao: [ {
            index: 0,
            y: "初六：允升，大吉。",
            x: "《象》曰：允升大吉，上合志也。"
        }, {
            index: 1,
            y: "九二：孚乃利用 ，无咎。",
            x: "《象》曰：九二之孚，有喜也。"
        }, {
            index: 2,
            y: "九三：升虚邑。",
            x: "《象》曰：升虚邑，无所疑也。"
        }, {
            index: 3,
            y: "六四：王用亨于岐山，吉无咎。",
            x: "《象》曰：王用亨于岐山，顺事也。"
        }, {
            index: 4,
            y: "六五：贞吉，升阶。",
            x: "《象》曰：贞吉升阶，大得志也。"
        }, {
            index: 5,
            y: "上六：冥升，利于不息之贞。",
            x: "《象》曰：冥升在上，消不富也。"
        } ]
    };