export const dataList = {
        gua: {
            m: "地火明夷",
            y: "明夷：利艰贞。",
            t: "《彖》曰：明入地中，明夷。内文明而外柔顺，以蒙大难，文王以之。利艰贞，晦其明也。内难而能正其志，箕子以之。",
            x: "《象》曰：明入地中，明夷；君子以莅众，用晦而明。"
        },
        yao: [ {
            index: 0,
            y: "初九：明夷于飞，垂其翼。 君子于行，三日不食， 有攸往，主人有言。",
            x: "《象》曰：君子于行，义不食也。"
        }, {
            index: 1,
            y: "六二：明夷，夷于左股，用拯马壮，吉。",
            x: "《象》曰：六二之吉，顺以则也。"
        }, {
            index: 2,
            y: "九三：明夷于南狩，得其大首，不可疾贞。",
            x: "《象》曰：南狩之志，乃大得也。"
        }, {
            index: 3,
            y: "六四：入于左腹，获明夷之心，出于门庭。",
            x: "《象》曰：入于左腹，获心意也。"
        }, {
            index: 4,
            y: "六五：箕子之明夷，利贞。",
            x: "《象》曰：箕子之贞，明不可息也。"
        }, {
            index: 5,
            y: "上六：不明晦，初登于天，后入于地。",
            x: "《象》曰：初登于天，照四国也。后入于地，失则也。"
        } ]
    };