export const dataList = {
        gua: {
            m: "地雷复",
            y: "复 ：亨。 出入无疾，朋来无咎。 反 其道，七日来 ，利有攸往。",
            t: "《彖》曰：复亨，刚反，动而以顺行，是以出入无疾，朋来无咎。反复其道，七日来复，天行也。利有攸往，刚长也。复，其见天地之心乎！",
            x: "《象》曰：雷在地中，复；先王以至日闭关，商旅不行，后不省方。"
        },
        yao: [ {
            index: 0,
            y: "初九：不远复，无只悔，元吉。",
            x: "《象》曰：不远之复，以修身也。"
        }, {
            index: 1,
            y: "六二：休复，吉。",
            x: "《象》曰：休复之吉，以下仁也。"
        }, {
            index: 2,
            y: "六三：频复，厉无咎。",
            x: "《象》曰：频复之厉，义无咎也。"
        }, {
            index: 3,
            y: "六四：中行独复。",
            x: "《象》曰：中行独复，以从道也。"
        }, {
            index: 4,
            y: "六五：敦复，无悔。",
            x: "《象》曰：敦复无悔，中以自考也。"
        }, {
            index: 5,
            y: "上六：迷复，凶，有灾眚。用行师，终有大败，以其国君，凶；至于十年，不克征。",
            x: "《象》曰：迷复之凶，反君道也。"
        } ]
    };