export const dataList = {
        gua: {
            m: "地水师",
            y: "师：贞，丈人，吉无咎。",
            t: "《彖》曰：师，众也；贞，正也。能以众正，可以王矣。刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣。",
            x: "《象》曰：地中有水，师；君子以容民畜众。"
        },
        yao: [ {
            index: 0,
            y: "初六：师出以律，否臧凶。",
            x: "《象》曰：师出以律，失律凶也。"
        }, {
            index: 1,
            y: "九二：在师中，吉无咎，王三锡命。",
            x: "《象》曰：在师中吉，承天宠也。王三锡命，怀万邦也。"
        }, {
            index: 2,
            y: "六三：师或舆尸，凶。",
            x: "《象》曰：师或舆尸，大无功也。"
        }, {
            index: 3,
            y: "六四：师左次，无咎。",
            x: "《象》曰：左次无咎，未失常也。"
        }, {
            index: 4,
            y: "六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
            x: "《象》曰：长子帅师，以中行也。弟子舆尸，使不当也。"
        }, {
            index: 5,
            y: "上六：大君有命，开国承家，小人勿用。",
            x: "《象》曰：大君有命，以正功也。小人勿用，必乱邦也。"
        } ]
    };