export const dataList = {
        gua: {
            m: "地山谦",
            y: "谦：亨，君子有终。",
            t: "《彖》曰：谦亨，天道下济而光明，地道卑而上行。天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。谦尊而光，卑而不可逾，君子之终也。",
            x: "《象》曰：地中有山，谦；君子以裒多益寡，称物平施。"
        },
        yao: [ {
            index: 0,
            y: "初六：谦谦君子，用涉大川，吉。",
            x: "《象》曰：谦谦君子，卑以自牧也。"
        }, {
            index: 1,
            y: "六二：鸣谦，贞吉。",
            x: "《象》曰：鸣谦贞吉，中心得也。"
        }, {
            index: 2,
            y: "九三：劳谦君子，有终吉。",
            x: "《象》曰：劳谦君子，万民服也。"
        }, {
            index: 3,
            y: "六四：无不利， 谦。",
            x: "《象》曰：无不利撝谦，不违则也。"
        }, {
            index: 4,
            y: "六五：不富，以其邻，利用侵伐，无不利。",
            x: "《象》曰：利用侵伐，征不服也。"
        }, {
            index: 5,
            y: "上六：鸣谦，利用行师，征邑国。",
            x: "《象》曰：鸣谦，志未得也。可用行师，征邑国也。"
        } ]
    };