export const dataList = {
        gua: {
            m: "地天泰",
            y: "泰：小往大来，吉亨。",
            t: "《彖》曰：泰，小往大来，吉，亨。则是天地交而万物通也，上下交而其志同也。内阳而外阴，内健而外顺，内君子而外小人，君子道长，小人道消也。",
            x: "《象》曰：天地交，泰；后以财成天地之道，辅相天地之宜，以左右民。"
        },
        yao: [ {
            index: 0,
            y: "初九：拔茅茹，以其夤，征吉。",
            x: "《象》曰：拔茅征吉，志在外也。"
        }, {
            index: 1,
            y: "九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。",
            x: "《象》曰：包荒得尚于中行以光大也。"
        }, {
            index: 2,
            y: "九三：无平不陂，无往不 ，艰贞无咎。 勿恤其孚，于食有福。",
            x: "《象》曰：无往不复，天地际也。"
        }, {
            index: 3,
            y: "六四：翩翩不富，以其邻，不戒以孚。",
            x: "《象》曰：翩翩不富，皆失实也。不戒以孚，中心愿也。"
        }, {
            index: 4,
            y: "六五：帝乙归妹，以祉元吉。",
            x: "《象》曰：以祉元吉，中以行愿也。"
        }, {
            index: 5,
            y: "上六：城 于隍，勿用师。 自邑告命，贞吝。",
            x: "《象》曰：城复于隍，其命乱也。"
        } ]
    };