export const dataList = {
        gua: {
            m: "兑为泽",
            y: "兑：亨，利贞。",
            t: "《彖》曰：兑，说也。刚中而柔外，说以利贞，是以顺乎天，而应乎人。说以先民，民忘其劳。说以犯难，民忘其死。兑之大，民劝矣哉。",
            x: "《象》曰：丽泽，兑；君子以朋友讲习。"
        },
        yao: [ {
            index: 0,
            y: "初九：和兑，吉。",
            x: "《象》曰：和兑之吉，行未疑也。"
        }, {
            index: 1,
            y: "九二：孚兑，吉，悔亡。",
            x: "《象》曰：孚兑之吉，信志也。"
        }, {
            index: 2,
            y: "六三：来兑，凶。",
            x: "《象》曰：来兑之凶，位不当也。"
        }, {
            index: 3,
            y: "九四：商兑，未宁，介疾有喜。",
            x: "《象》曰：九四之喜，有庆也。"
        }, {
            index: 4,
            y: "九五：孚于剥，有厉。",
            x: "《象》曰：孚于剥，位正当也。"
        }, {
            index: 5,
            y: "上六：引兑。",
            x: "《象》曰：上六引兑，未光也。"
        } ]
    };