export const dataList = {
        gua: {
            m: "风山渐",
            y: "渐：女归吉，利贞。",
            t: "《彖》曰：渐，之进也，女归吉也。进得位，往有功也。进以正，可以正邦也。其位，刚得中也。止而巽，动不穷也。",
            x: "《象》曰：山上有木，渐；君子以居贤德善俗。"
        },
        yao: [ {
            index: 0,
            y: "初六：鸿渐于干，小子厉，有言，无咎。",
            x: "《象》曰：小子之厉，义无咎也。"
        }, {
            index: 1,
            y: "六二：鸿渐于磐，饮食，吉。",
            x: "《象》曰：饮食衎衎，不素饱也。"
        }, {
            index: 2,
            y: "九三：鸿渐于陆，夫征不 ，妇孕不育，凶；利御寇。",
            x: "《象》曰：夫征不复，离群丑也。妇孕不育，失其道也。利用御寇，顺相保也。"
        }, {
            index: 3,
            y: "六四：鸿渐于木，或得其桷，无咎。",
            x: "《象》曰：或得其桷，顺以巽也。"
        }, {
            index: 4,
            y: "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。",
            x: "《象》曰：终莫之胜吉，得所愿也。"
        }, {
            index: 5,
            y: "上九：鸿渐于逵，其羽可用为仪，吉。",
            x: "《象》曰：其羽可用为仪吉，不可乱也。"
        } ]
    };