export const dataList = {
        gua: {
            m: "风水涣",
            y: "涣：亨。 王假有庙，利涉大川，利贞。",
            t: "《彖》曰：涣亨，刚来而不穷，柔得位乎外，而上同。王假有庙，王乃在中也。利涉大川，乘木有功也。",
            x: "《象》曰：风行水上，涣；先王以享于帝，立庙。"
        },
        yao: [ {
            index: 0,
            y: "初六：用拯马壮，吉。",
            x: "《象》曰：初六之吉，顺也。"
        }, {
            index: 1,
            y: "九二：涣奔其机，悔亡。",
            x: "《象》曰：涣奔其机，得愿也。"
        }, {
            index: 2,
            y: "六三：涣其躬，无悔。",
            x: "《象》曰：涣其躬，志在外也。"
        }, {
            index: 3,
            y: "六四：涣其群，元吉。 涣有丘，匪夷所思。",
            x: "《象》曰：涣其群元吉，光大也。"
        }, {
            index: 4,
            y: "九五：涣汗其大号，涣王居，无咎。",
            x: "《象》曰：王居无咎，正位也。"
        }, {
            index: 5,
            y: "上九：涣其血，去逖出，无咎。",
            x: "《象》曰：涣其血，远害也。"
        } ]
    };