export const dataList = {
        gua: {
            m: "风火家人",
            y: "家人：利女贞。",
            t: "《彖》曰：家人，女正位乎内，男正位乎外。男女正，天地之大义也。家人有严君焉，父母之谓也。父父、子子、兄兄、弟弟、夫夫、妇妇，而家道正。正家，而天下定矣。",
            x: "《象》曰：风自火出，家人；君子以言有物而行有恒。"
        },
        yao: [ {
            index: 0,
            y: "初九：闲有家，悔亡。",
            x: "《象》曰：闲有家，志未变也。"
        }, {
            index: 1,
            y: "六二：无攸遂，在中馈，贞吉。",
            x: "《象》曰：六二之吉，顺以巽也。"
        }, {
            index: 2,
            y: "九三：家人 ，悔厉吉；妇子嘻嘻，终吝。",
            x: "《象》曰：家人嗃嗃，未失也。妇子嘻嘻，失家节也。"
        }, {
            index: 3,
            y: "六四：富家，大吉。",
            x: "《象》曰：富家大吉，顺在位也。"
        }, {
            index: 4,
            y: "九五：王假有家，勿恤吉。",
            x: "《象》曰：王假有家，交相爱也。"
        }, {
            index: 5,
            y: "上九：有孚威如，终吉。",
            x: "《象》曰：威如之吉，反身之谓也。"
        } ]
    };