export const dataList = {
        gua: {
            m: "风泽中孚",
            y: "中孚：豚鱼吉，利涉大川，利贞。",
            t: "《彖》曰：中孚，柔在内而刚得中，说而巽，孚乃化邦也。豚鱼吉，信及豚鱼也。利涉大川，乘木舟虚也。中孚以利贞，乃应乎天也。",
            x: "《象》曰：泽上有风，中孚；君子以议狱缓死。"
        },
        yao: [ {
            index: 0,
            y: "初九：虞吉，有他不燕。",
            x: "《象》曰：初九虞吉，志未变也。"
        }, {
            index: 1,
            y: "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",
            x: "《象》曰：其子和之，中心愿也。"
        }, {
            index: 2,
            y: "六三：得敌，或鼓或罢，或泣或歌。",
            x: "《象》曰：或鼓或罢，位不当也。"
        }, {
            index: 3,
            y: "六四：月几望，马匹亡，无咎。",
            x: "《象》曰：马匹亡，绝类上也。"
        }, {
            index: 4,
            y: "九五：有孚挛如，无咎。",
            x: "《象》曰：有孚挛如，位正当也。"
        }, {
            index: 5,
            y: "上九：翰音登于天，贞凶。",
            x: "《象》曰：翰音登于天，何可长也。"
        } ]
    };