export const dataList = {
        gua: {
            m: "风地观",
            y: "观：盥而不荐，有孚 若。",
            t: "《彖》曰：大观在上，顺而巽，中正以观天下。观，盥而不荐，有孚颙若，下观而化也。观天之神道，而四时不忒；圣人以神道设教，而天下服矣。",
            x: "《象》曰：风行地上，观；先王以省方观民设教。"
        },
        yao: [ {
            index: 0,
            y: "初六：童观，小人无咎，君子吝。",
            x: "《象》曰：初六童观，小人道也。"
        }, {
            index: 1,
            y: "六二：窥观，利女贞。",
            x: "《象》曰：窥观女贞，亦可丑也。"
        }, {
            index: 2,
            y: "六三：观我生，进退。",
            x: "《象》曰：观我生进退，未失道也。"
        }, {
            index: 3,
            y: "六四：观国之光，利用宾于王。",
            x: "《象》曰：观国之光，尚宾也。"
        }, {
            index: 4,
            y: "九五：观我生，君子无咎。",
            x: "《象》曰：观我生，观民也。"
        }, {
            index: 5,
            y: "上九：观其生，君子无咎。",
            x: "《象》曰：观其生，志未平也。"
        } ]
    };