export const dataList = {
        gua: {
            m: "风雷益",
            y: "益：利有攸往，利涉大川。",
            t: "《彖》曰：益，损上益下，民说无疆。自上下下，其道大光。利有攸往，中正有庆。利涉大川，木道乃行。益动而巽，日进无疆。天施地生，其益无方。凡益之道，与时偕行。",
            x: "《象》曰：风雷，益；君子以见善则迁，有过则改。"
        },
        yao: [ {
            index: 0,
            y: "初九：利用为大作，元吉，无咎。",
            x: "《象》曰：元吉无咎，下不厚事也。"
        }, {
            index: 1,
            y: "六二：或益之，十朋之龟弗克违，永贞吉。 王用享于帝，吉。",
            x: "《象》曰：或益之，自外来也。"
        }, {
            index: 2,
            y: "六三：益之用凶事，无咎。 有孚中行，告公用圭。",
            x: "《象》曰：益用凶事，固有之也。"
        }, {
            index: 3,
            y: "六四：中行，告公从。 利用为依迁国。",
            x: "《象》曰：告公从，以益志也。"
        }, {
            index: 4,
            y: "九五：有孚惠心，勿问元吉。 有孚惠我德。",
            x: "《象》曰：有孚惠心，勿问之矣。惠我德，大得志也。"
        }, {
            index: 5,
            y: "上九：莫益之，或击之，立心勿恒，凶。",
            x: "《象》曰：莫益之，偏辞也。或击之，自外来也。"
        } ]
    };