export const dataList = {
        gua: {
            m: "艮为山",
            y: "艮：艮其背，不获其身，行其庭，不见其人，无咎。",
            t: "《彖》曰：艮，止也。时止则止，时行则行，动静不失其时，其道光明。艮其止，止其所也。上下敌应，不相与也。是以不获其身，行其庭不见其人，无咎也。",
            x: "《象》曰：兼山，艮；君子以思不出其位。"
        },
        yao: [ {
            index: 0,
            y: "初六：艮其趾，无咎，利永贞。",
            x: "《象》曰：艮其趾，未失正也。"
        }, {
            index: 1,
            y: "六二：艮其腓，不拯其随，其心不快。",
            x: "《象》曰：不拯其随，未退听也。"
        }, {
            index: 2,
            y: "九三：艮其限，列其夤，厉薰心。",
            x: "《象》曰：艮其限，危熏心也。"
        }, {
            index: 3,
            y: "六四：艮其身，无咎。",
            x: "《象》曰：艮其身，止诸躬也。"
        }, {
            index: 4,
            y: "六五：艮其辅，言有序，悔亡。",
            x: "《象》曰：艮其辅，以中正也。"
        }, {
            index: 5,
            y: "上九：敦艮，吉。",
            x: "《象》曰：敦艮之吉，以厚终也。"
        } ]
    };