export const dataList = {
        gua: {
            m: "火地晋",
            y: "晋：康侯用锡马蕃庶，昼日三接。",
            t: "《彖》曰：晋，进也，明出地上，顺而丽乎大明，柔进而上行，是以康侯用锡马蕃庶，昼日三接也。",
            x: "《象》曰：明出地上，晋；君子以自昭明德。"
        },
        yao: [ {
            index: 0,
            y: "初六：晋如，摧如，贞吉。 罔孚，裕无咎。",
            x: "《象》曰：晋如摧如，独行正也。"
        }, {
            index: 1,
            y: "六二：晋如，愁如，贞吉。 受兹介福，于其王母。",
            x: "《象》曰：裕无咎，未受命也。"
        }, {
            index: 2,
            y: "六三：众允，悔亡。",
            x: "《象》曰：受兹介福，以中正也。众允之志，上行也。"
        }, {
            index: 3,
            y: "九四：晋如硕鼠，贞厉。",
            x: "《象》曰：鼫鼠贞厉，位不当也。"
        }, {
            index: 4,
            y: "六五：悔亡，失得勿恤，往吉无不利。",
            x: "《象》曰：失得勿恤，往有庆也。"
        }, {
            index: 5,
            y: "上九：晋其角，维用伐邑，厉吉无咎，贞吝。",
            x: "《象》曰：维用伐邑，道未光也。"
        } ]
    };