export const dataList = {
        gua: {
            m: "火风鼎",
            y: "鼎：元吉，亨。",
            t: "《彖》曰：鼎，象也。以木巽火，亨饪也。圣人亨以享上帝，而大亨以养圣贤。巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。",
            x: "《象》曰：木上有火，鼎；君子以正位凝命。"
        },
        yao: [ {
            index: 0,
            y: "初六：鼎颠趾，利出否，得妾以其子，无咎。",
            x: "《象》曰：鼎颠趾，未悖也。利出否，以从贵也。"
        }, {
            index: 1,
            y: "九二：鼎有实，我仇有疾，不我能即，吉。",
            x: "《象》曰：鼎有实，慎所之也。我仇有疾，终无尤也。"
        }, {
            index: 2,
            y: "九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",
            x: "《象》曰：鼎耳革，失其义也。"
        }, {
            index: 3,
            y: "九四：鼎折足，覆公餗，其形渥，凶。",
            x: "《象》曰：覆公餗，信如何也。"
        }, {
            index: 4,
            y: "六五：鼎黄耳金铉，利贞。",
            x: "《象》曰：鼎黄耳，中以为实也。"
        }, {
            index: 5,
            y: "上九：鼎玉铉，大吉，无不利。",
            x: "《象》曰：玉铉在上，刚柔节也。"
        } ]
    };