export const dataList = {
        gua: {
            m: "火雷噬嗑",
            y: "噬嗑：亨。 利用狱。",
            t: "《彖》曰：颐中有物，曰噬嗑。噬嗑而亨，刚柔分，动而明，雷电合而章。柔得中而上行，虽不当位，利用狱也。",
            x: "《象》曰：雷电，噬嗑；先王以明罚敕法。"
        },
        yao: [ {
            index: 0,
            y: "初九：履校灭趾，无咎。",
            x: "《象》曰：屦校灭趾，不行也。"
        }, {
            index: 1,
            y: "六二：噬肤灭鼻，无咎。",
            x: "《象》曰：噬肤灭鼻，乘刚也。"
        }, {
            index: 2,
            y: "六三：噬腊肉，遇毒；小吝，无咎。",
            x: "《象》曰：遇毒，位不当也。"
        }, {
            index: 3,
            y: "九四：噬乾胏，得金矢，利艰贞，吉。",
            x: "《象》曰：利艰贞吉，未光也。"
        }, {
            index: 4,
            y: "六五：噬乾肉，得黄金，贞厉，无咎。",
            x: "《象》曰：贞厉无咎，得当也。"
        }, {
            index: 5,
            y: "上九：何校灭耳，凶。",
            x: "《象》曰：何校灭耳，聪不明也。"
        } ]
    };