export const dataList = {
        gua: {
            m: "山火贲",
            y: "贲：亨。 小利有所往。",
            t: "《彖》曰：贲，亨，柔来而文刚，故亨；分刚上而文柔，故小利有攸住，天文也；文明以止，人文也。观乎天文，以察时变；观乎人文，以化成天下。",
            x: "《象》曰：山下有火，贲；君子以明庶政，无敢折狱。"
        },
        yao: [ {
            index: 0,
            y: "初九：贲其趾，舍车而徒。",
            x: "《象》曰：舍车而徒，义弗乘也。"
        }, {
            index: 1,
            y: "六二：贲其须。",
            x: "《象》曰：贲其须，与上兴也。"
        }, {
            index: 2,
            y: "九三：贲如濡如，永贞吉。",
            x: "《象》曰：永贞之吉，终莫之陵也。"
        }, {
            index: 3,
            y: "六四：贲如皤如，白马翰如，匪寇婚媾。",
            x: "《象》曰：六四，当位疑也。匪寇婚媾，终无尤也。"
        }, {
            index: 4,
            y: "六五：贲于丘园，束帛戋戋，吝，终吉。",
            x: "《象》曰：六五之吉，有喜也。"
        }, {
            index: 5,
            y: "上九：白贲，无咎。",
            x: "《象》曰：白贲无咎，上得志也。"
        } ]
    };