export const dataList = {
        gua: {
            m: "火山旅",
            y: "旅：小亨，旅贞吉。",
            t: "《彖》曰：旅，小亨，柔得中乎外，而顺乎刚，止而丽乎明，是以小亨旅贞吉也。旅之时义大矣哉。",
            x: "《象》曰：山上有火，旅；君子以明慎用刑，而不留狱。"
        },
        yao: [ {
            index: 0,
            y: "初六：旅琐琐，斯其所取灾。",
            x: "《象》曰：旅琐琐，志穷灾也。"
        }, {
            index: 1,
            y: "六二：旅即次，怀其资，得童仆贞。",
            x: "《象》曰：得童仆贞，终无尤也。"
        }, {
            index: 2,
            y: "九三：旅焚其次，丧其童仆，贞厉。",
            x: "《象》曰：旅焚其次，亦以伤矣。以旅与下，其义丧也。"
        }, {
            index: 3,
            y: "九四：旅于处，得其资斧，我心不快。",
            x: "《象》曰：旅于处，未得位也。得其资斧，心未快也。"
        }, {
            index: 4,
            y: "六五：射雉一矢亡，终以誉命。",
            x: "《象》曰：终以誉命，上逮也。"
        }, {
            index: 5,
            y: "上九：鸟焚其巢，旅人先笑后号啕。 丧牛于易，凶。",
            x: "《象》曰：以旅在上，其义焚也。丧牛于易，终莫之闻也。"
        } ]
    };