export const dataList = {
        gua: {
            m: "火泽睽",
            y: "睽：小事吉。",
            t: "《彖》曰：睽，火动而上，泽动而下。二女同居，其志不同行。说而丽乎明，柔进而上行，得中而应乎刚，是以小事吉。天地睽而其事同也，男女睽而其志通也，万物睽而其事类也。睽之时用大矣哉。",
            x: "《象》曰：上火下泽，睽；君子以同而异。"
        },
        yao: [ {
            index: 0,
            y: "初九：悔亡，丧马勿逐，自 ；见恶人无咎。",
            x: "《象》曰：见恶人，以辟咎也。"
        }, {
            index: 1,
            y: "九二：遇主于巷，无咎。",
            x: "《象》曰：遇主于巷，未失道也。"
        }, {
            index: 2,
            y: "六三：见舆曳，其牛掣，其人天且劓，无初有终。",
            x: "《象》曰：见舆曳，位不当也。无初有终，遇刚也。"
        }, {
            index: 3,
            y: "九四：睽孤，遇元夫，交孚，厉无咎。",
            x: "《象》曰：交孚无咎，志行也。"
        }, {
            index: 4,
            y: "六五：悔亡，厥宗噬肤，往何咎。",
            x: "《象》曰：厥宗噬肤，往有庆也。"
        }, {
            index: 5,
            y: "上九：睽孤， 见豕负涂，载鬼一车， 先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。",
            x: "《象》曰：遇雨之吉，群疑亡也。"
        } ]
    };