export const dataList = {
        gua: {
            m: "坎为水",
            y: "坎：习坎，有孚，维心亨，行有尚。",
            t: "《彖》曰：习坎，重险也。水流而不盈，行险而不失其信，维心亨，乃以刚中也。行有尚，往有功也。天险不可升也，地险山川丘陵也，王公设险以守其国。险之时用大矣哉。",
            x: "《象》曰：水洊至，习坎；君子以常德行，习教事。"
        },
        yao: [ {
            index: 0,
            y: "初六：习坎，入于坎 ，凶。",
            x: "《象》曰：习坎入坎，失道凶也。"
        }, {
            index: 1,
            y: "九二：坎有险，求小得。",
            x: "《象》曰：求小得，未出中也。"
        }, {
            index: 2,
            y: "六三：来之坎坎，险且枕，入于坎 ，勿用。",
            x: "《象》曰：来之坎坎，终无功也。"
        }, {
            index: 3,
            y: "六四：樽酒簋贰，用缶，纳约自牖，终无咎。",
            x: "《象》曰：樽酒簋贰，刚柔际也。"
        }, {
            index: 4,
            y: "九五：坎不盈，只既平，无咎。",
            x: "《象》曰：坎不盈，中未大也。"
        }, {
            index: 5,
            y: "上六：系用徽 ，置于丛棘，三岁不得，凶。",
            x: "《象》曰：上六失道，凶三岁也。"
        } ]
    };