export const dataList = {
        gua: {
            m: "雷地豫",
            y: "豫：利建侯行师。",
            t: "《彖》曰：豫，刚应而志行，顺以动，豫。豫顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过而四时不忒；圣人以顺动，则刑罚清而民服。豫之时义大矣哉。",
            x: "《象》曰：雷出地奋，豫；先王以作乐崇德，殷荐之上帝，以配祖考。"
        },
        yao: [ {
            index: 0,
            y: "初六：鸣豫，凶。",
            x: "《象》曰：初六鸣豫，志穷凶也。"
        }, {
            index: 1,
            y: "六二：介于石，不终日，贞吉。",
            x: "《象》曰：不终日贞吉，以中正也。"
        }, {
            index: 2,
            y: "六三：盱豫，悔。 迟有悔。",
            x: "《象》曰：盱豫有悔，位不当也。"
        }, {
            index: 3,
            y: "九四：由豫，大有得。勿疑。 朋盍簪。",
            x: "《象》曰：由豫大有得，志大行也。"
        }, {
            index: 4,
            y: "六五：贞疾，恒不死。",
            x: "《象》曰：六五贞疾，乘刚也。恒不死，中未亡也。"
        }, {
            index: 5,
            y: "上六：冥豫，成有渝，无咎。",
            x: "《象》曰：冥豫在上，何可长也。"
        } ]
    };