export const dataList = {
        gua: {
            m: "雷火丰",
            y: "丰：亨，王假之，勿忧，宜日中。",
            t: "《彖》曰：丰，大也。明以动，故丰。王假之，尚大也。勿忧宜日中，宜照天下也。日中则昃，月盈则食，天地盈虚，与时消息，而况于人乎，况于鬼神乎。",
            x: "《象》曰：雷电皆至，丰；君子以折狱致刑。"
        },
        yao: [ {
            index: 0,
            y: "初九：遇其配主，虽旬无咎，往有尚。",
            x: "《象》曰：虽旬无咎，过旬灾也。"
        }, {
            index: 1,
            y: "六二：丰其 ，日中见斗，往得疑疾，有孚发若，吉。",
            x: "《象》曰：有孚发若，信以发志也。"
        }, {
            index: 2,
            y: "九三：丰其沛，日中见昧，折其右肱，无咎。",
            x: "《象》曰：丰其沛，不可大事也。折其右肱，终不可用也。"
        }, {
            index: 3,
            y: "九四：丰其 ，日中见斗，遇其夷主，吉。",
            x: "《象》曰：丰其蔀，位不当也。日中见斗，幽不明也。遇其夷主吉行也。"
        }, {
            index: 4,
            y: "六五：来章，有庆誉，吉。",
            x: "《象》曰：六五之吉，有庆也。"
        }, {
            index: 5,
            y: "上六：丰其屋， 其家，极其户，阒其无人，三岁不见，凶。",
            x: "《象》曰：丰其屋，天际翔也。窥其户阒其无人，自藏也。"
        } ]
    };