export const dataList = {
        gua: {
            m: "雷水解",
            y: "解：利西南，无所往，其来 吉。有攸往，夙吉。",
            t: "《彖》曰：解，险以动，动而免乎险，解。解利西南，往得众也。无所往，其来复吉，乃得中也。有攸往夙吉，往有功也。天地解而雷雨作，雷雨作而百果草木皆甲坼。解之时大矣哉。",
            x: "《象》曰：雷雨作，解；君子以赦过宥罪。"
        },
        yao: [ {
            index: 0,
            y: "初六：无咎。",
            x: "《象》曰：刚柔之际，义无咎也。"
        }, {
            index: 1,
            y: "九二：田获三狐，得黄矢，贞吉。",
            x: "《象》曰：九二贞吉，得中道也。"
        }, {
            index: 2,
            y: "六三：负且乘，致寇至，贞吝。",
            x: "《象》曰：负且乘，亦可丑也。自我致戎，又谁咎也。"
        }, {
            index: 3,
            y: "九四：解而拇，朋至斯孚。",
            x: "《象》曰：解而拇，未当位也。"
        }, {
            index: 4,
            y: "六五：君子维有解，吉；有孚于小人。",
            x: "《象》曰：君子有解，小人退也。"
        }, {
            index: 5,
            y: "上六：公用射隼，于高墉之上，获之，无不利。",
            x: "《象》曰：公用射隼，以解悖也。"
        } ]
    };