export const dataList = {
        gua: {
            m: " 雷山小过",
            y: "小过：亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上宜下，大吉。",
            t: "《彖》曰：小过，小者过而亨也。过以利贞，与时行也。柔得中，是以小事吉也。刚失位而不中，是以不可大事也。有飞鸟之象焉，飞鸟遗之音，不宜上宜下大吉，上逆而下顺也。",
            x: "《象》曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。"
        },
        yao: [ {
            index: 0,
            y: "初六：飞鸟以凶。",
            x: "《象》曰：飞鸟以凶，不可如何也。"
        }, {
            index: 1,
            y: "六二：过其祖，遇其妣；不及其君，遇其臣；无咎。",
            x: "《象》曰：不及其君，臣不可过也。"
        }, {
            index: 2,
            y: "九三：弗过防之，从或戕之，凶。",
            x: "《象》曰：从或戕之，凶如何也。"
        }, {
            index: 3,
            y: "九四：无咎，弗过遇之。 往厉必戒，勿用永贞。",
            x: "《象》曰：弗过遇之，位不当也。往厉必戒，终不可长也。"
        }, {
            index: 4,
            y: "六五：密云不雨，自我西郊，公弋取彼在穴。",
            x: "《象》曰：密云不雨，已上也。"
        }, {
            index: 5,
            y: "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。",
            x: "《象》曰：弗遇过之，已亢也。"
        } ]
    };