export const dataList = {
        gua: {
            m: "雷天大壮",
            y: "大壮：利贞。",
            t: "《彖》曰：大壮，大者壮也。刚以动，故壮。大壮利贞，大者正也。正大，而天地之情可见矣。",
            x: "《象》曰：雷在天上，大壮；君子以非礼弗履。"
        },
        yao: [ {
            index: 0,
            y: "初九：壮于趾，征凶，有孚。",
            x: "《象》曰：壮于趾，其孚穷也。"
        }, {
            index: 1,
            y: "九二：贞吉。",
            x: "《象》曰：九二贞吉，以中也。"
        }, {
            index: 2,
            y: "九三：小人用壮，君子用罔，贞厉。 羝羊触藩，羸其角。",
            x: "《象》曰：小人用壮，君子罔也。"
        }, {
            index: 3,
            y: "九四：贞吉悔亡，藩决不羸，壮于大之 。",
            x: "《象》曰：藩决不羸，尚往也。"
        }, {
            index: 4,
            y: "六五：丧羊于易，无悔。",
            x: "《象》曰：丧羊于易，位不当也。"
        }, {
            index: 5,
            y: "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。",
            x: "《象》曰：不能退不能遂，不详也。艰则吉，咎不长也。"
        } ]
    };