export const dataList = {
        gua: {
            m: "雷泽归妹",
            y: "归妹：征凶，无攸利。",
            t: "《彖》曰：归妹，天地之大义也。天地不交，而万物不兴。归妹，人之终始也。说以动，所归妹也。征凶，位不当也。无攸利，柔乘刚也。",
            x: "《象》曰：泽上有雷，归妹；君子以永终知敝。"
        },
        yao: [ {
            index: 0,
            y: "初九：归妹以娣，跛能履，征吉。",
            x: "《象》曰：归妹以娣，以恒也。跛能履吉，相承也。"
        }, {
            index: 1,
            y: "九二：眇能视，利幽人之贞。",
            x: "《象》曰：利幽人之贞，未变常也。"
        }, {
            index: 2,
            y: "六三：归妹以须，反归以娣。",
            x: "《象》曰：归妹以须，未当也。"
        }, {
            index: 3,
            y: "九四：归妹愆期，迟归有时。",
            x: "《象》曰：愆期之志，有待而行也。"
        }, {
            index: 4,
            y: "六五：帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。",
            x: "《象》曰：帝乙归妹，不如其娣之袂良也。其位在中，以贵行也。"
        }, {
            index: 5,
            y: "上六：女承筐无实，士 羊无血，无攸利。",
            x: "《象》曰：上六无实，承虚筐也。"
        } ]
    };