export const dataList = {
        gua: {
            m: "离为火",
            y: "离：利贞，亨。 畜牝牛，吉。",
            t: "《彖》曰：离，丽也；日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下。柔丽乎中正，故亨，是以畜牝牛吉也。",
            x: "《象》曰：明两作，离；大人以继明照于四方。"
        },
        yao: [ {
            index: 0,
            y: "初九：履错然，敬之无咎。",
            x: "《象》曰：履错之敬，以辟咎也。"
        }, {
            index: 1,
            y: "六二：黄离，元吉。",
            x: "《象》曰：黄离元吉，得中道也。"
        }, {
            index: 2,
            y: "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
            x: "《象》曰：日昃之离，何可久也。"
        }, {
            index: 3,
            y: "九四：突如其来如，焚如，死如，弃如。",
            x: "《象》曰：突如其来如，无所容也。"
        }, {
            index: 4,
            y: "六五：出涕沱若，戚嗟若，吉。",
            x: "《象》曰：六五之吉，离王公也。"
        }, {
            index: 5,
            y: "上九：王用出征，有嘉折首，获其匪丑，无咎。",
            x: "《象》曰：王用出征，以正邦也。"
        } ]
    };