export const dataList = {
        gua: {
            m: "乾为天",
            y: "乾：元，亨，利，贞。",
            t: "《彖》曰：大哉乾元、万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成，时乘六龙以御天。乾道变化，各正性命，保合太和，乃利贞。首出庶物，万国咸宁。",
            x: "《象》曰：天行健；君子以自强不息。用九，天德不可为首也。",
            yong: "用九：见群龙无首，吉。"
        },
        yao: [ {
            index: 0,
            y: "初九：潜龙勿用。",
            x: "《象》曰：潜龙勿用，阳在下也。"
        }, {
            index: 1,
            y: "九二：见龙再田，利见大人。",
            x: "《象》曰：见龙在田，德施普也。"
        }, {
            index: 2,
            y: "九三：君子终日乾乾，夕惕若，厉，无咎。",
            x: "《象》曰：终日乾乾，反复道也。"
        }, {
            index: 3,
            y: "九四：或跃在渊，无咎。",
            x: "《象》曰：或跃在渊,进无咎也。"
        }, {
            index: 4,
            y: "九五：飞龙在天，利见大人。",
            x: "《象》曰：飞龙在天，大人造也。"
        }, {
            index: 5,
            y: "上九：亢龙有悔。",
            x: "《象》曰：亢龙有悔，盈不可久也。"
        } ]
    };