export const dataList = {
        gua: {
            m: "山风蛊",
            y: "蛊：元亨，利涉大川。 先甲三日，后甲三日。",
            t: "《彖》曰：蛊，刚上而柔下，巽而止，蛊。蛊元亨，而天下治也。利涉大川，往有事也。先甲三日，後甲三日，终则有始，天行也。",
            x: "《象》曰：山下有风，蛊；君子以振民育德。"
        },
        yao: [ {
            index: 0,
            y: "初六：干父之蛊，有子，考无咎，厉终吉。",
            x: "《象》曰：干父之蛊，意承考也。"
        }, {
            index: 1,
            y: "九二：干母之蛊，不可贞。",
            x: "《象》曰：干母之蛊，得中道也。"
        }, {
            index: 2,
            y: "九三：干父小有晦，无大咎。",
            x: "《象》曰：干父之蛊，终无咎也。"
        }, {
            index: 3,
            y: "六四：裕父之蛊，往见吝。",
            x: "《象》曰：裕父之蛊，往未得也。"
        }, {
            index: 4,
            y: "六五：干父之蛊，用誉。",
            x: "《象》曰：干父用誉，承以德也。"
        }, {
            index: 5,
            y: "上九：不事王侯，高尚其事。",
            x: "《象》曰：不事王侯，志可则也。"
        } ]
    };