export const dataList = {
        gua: {
            m: "山泽损",
            y: "损：有孚，元吉，无咎，可贞，利有攸往？曷之用，二簋可用享。",
            t: "《彖》曰：损，损下益上，其道上行。损而有孚，元吉无咎，可贞，利有攸往。曷之用二簋，可用享。二簋应有时，损刚益柔有时。损益盈虚，与时偕行。",
            x: "《象》曰：山下有泽，损；君子以惩忿窒欲。"
        },
        yao: [ {
            index: 0,
            y: "初九：已事遄往，无咎，酌损之。",
            x: "《象》曰：巳事遄往，尚合志也。"
        }, {
            index: 1,
            y: "九二：利贞，征凶，弗损益之。",
            x: "《象》曰：九二利贞，中以为志也。"
        }, {
            index: 2,
            y: "六三：三人行，则损一人；一人行，则得其友。",
            x: "《象》曰：一人行，三则疑也。"
        }, {
            index: 3,
            y: "六四：损其疾，使遄有喜，无咎。",
            x: "《象》曰：损其疾，亦可喜也。"
        }, {
            index: 4,
            y: "六五：或益之，十朋之龟弗克违，元吉。",
            x: "《象》曰：六五元吉，自上祐也。"
        }, {
            index: 5,
            y: "上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。",
            x: "《象》曰：弗损益之，大得志也。"
        } ]
    };