export const dataList = {
        gua: {
            m: "山天大畜",
            y: "大畜：利贞，不家食吉，利涉大川。",
            t: "《彖》曰：大畜，刚健笃实辉光，日新其德，刚上而尚贤。能止健，大正也。不家食吉，养贤也。利涉大川，应乎天也。",
            x: "《象》曰：天在山中，大畜；君子以多识前贤往行，以畜其德。"
        },
        yao: [ {
            index: 0,
            y: "初九：有厉利已。",
            x: "《象》曰：有厉利巳，不犯灾也。"
        }, {
            index: 1,
            y: "九二：舆说辐。",
            x: "《象》曰：舆说輹，中无尤也。"
        }, {
            index: 2,
            y: "九三：良马逐，利艰贞。 曰闲舆卫，利有攸往。",
            x: "《象》曰：利有攸往，上合志也。"
        }, {
            index: 3,
            y: "六四：童豕之牿，元吉。",
            x: "《象》曰：六四元吉，有喜也。"
        }, {
            index: 4,
            y: "六五： 豕之牙，吉。",
            x: "《象》曰：六五之吉，有庆也。"
        }, {
            index: 5,
            y: "上九：何天之衢，亨。",
            x: "《象》曰：何天之衢，道大行也。"
        } ]
    };