export const dataList = {
        gua: {
            m: "山地剥",
            y: "剥：不利有攸往。",
            t: "《彖》曰：剥，剥也，柔变刚也。不利有攸往，小人长也。顺而止之，观象也。君子尚消息盈虚，天行也。",
            x: "《象》曰：山附于地，剥；上以厚下安宅。"
        },
        yao: [ {
            index: 0,
            y: "初六：剥床(爿木)以足蔑，贞凶。",
            x: "《象》曰剥床以足，以灭下也。"
        }, {
            index: 1,
            y: "六二：剥床以辨，蔑贞凶。",
            x: "《象》曰：剥床以辨，未有与也。"
        }, {
            index: 2,
            y: "六三：剥之，无咎。",
            x: "《象》曰：剥之无咎，失上下也。"
        }, {
            index: 3,
            y: "六四：剥床以肤，凶。",
            x: "《象》曰：剥床以肤，切近灾也。"
        }, {
            index: 4,
            y: "六五：贯鱼，以宫人宠，无不利。",
            x: "《象》曰：以宫人宠，终无尤也。"
        }, {
            index: 5,
            y: "上九：硕果不食，君子得舆，小人剥庐。",
            x: "《象》曰：君子得舆，民所载也。小人剥庐，终不可用也。"
        } ]
    };