export const dataList = {
        gua: {
            m: "山水蒙",
            y: "蒙：亨。 匪我求童蒙，童蒙求我。初噬告，再三渎，渎则不告。利贞。",
            t: "《彖》曰：蒙，山下有险，险而止，蒙。蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。初筮告，以刚中也。再三渎，渎则不告，渎蒙也。蒙以养正，圣功也。",
            x: "《象》曰：山下出泉，蒙；君子以果行育德。",
            yong: ""
        },
        yao: [ {
            index: 0,
            y: "初六：发蒙，利用刑人，用说桎梏，以往吝。",
            x: "《象》曰：利用刑人，以正法也。"
        }, {
            index: 1,
            y: "九二：包蒙吉；纳妇吉；子克家。",
            x: "《象》曰：子克家，刚柔接也。"
        }, {
            index: 2,
            y: "六三：勿用娶女；见金夫，不有躬，无攸利。",
            x: "《象》曰：勿用取女，行不顺也。"
        }, {
            index: 3,
            y: "六四：困蒙，吝。",
            x: "《象》曰：困蒙之吝，独远实也。"
        }, {
            index: 4,
            y: "六五：童蒙，吉。",
            x: "《象》曰：童蒙之吉，顺以巽也。"
        }, {
            index: 5,
            y: "上九：击蒙；不利为寇，利御寇。",
            x: "《象》曰：利用御寇，上下顺也。"
        } ]
    };