export const dataList = {
        gua: {
            m: "山雷颐",
            y: "颐：贞吉。 观颐，自求口实。",
            t: "《彖》曰：颐贞吉，养正则吉也。观颐，观其所养也；自求口实，观其自养也。天地养万物，圣人养贤以及万民。颐之时大矣哉。",
            x: "《象》曰：山下有雷，颐；君子以慎言语，节饮食。"
        },
        yao: [ {
            index: 0,
            y: "初九：舍尔灵龟，观我朵颐，凶。",
            x: "《象》曰：观我朵颐，亦不足贵也。"
        }, {
            index: 1,
            y: "六二：颠颐，拂经，于丘颐，征凶。",
            x: "《象》曰：六二征凶，行失类也。"
        }, {
            index: 2,
            y: "六三：拂颐，贞凶，十年勿用，无攸利。",
            x: "《象》曰：十年勿用，道大悖也。"
        }, {
            index: 3,
            y: "六四：颠颐吉，虎视眈眈，其欲逐逐，无咎。",
            x: "《象》曰：颠颐之吉，上施光也。"
        }, {
            index: 4,
            y: "六五：拂经，居贞吉，不可涉大川。",
            x: "《象》曰：居贞之吉，顺以从上也。"
        }, {
            index: 5,
            y: "上九：由颐，厉吉，利涉大川。",
            x: "《象》曰：由颐厉吉，大有庆也。"
        } ]
    };