export const dataList = {
        gua: {
            m: "火水未济",
            y: "未济：亨，小狐汔济，濡其尾，无攸利。",
            t: "《彖》曰：未济亨，柔得中也。小狐汔济，未出中也。濡其尾，无攸利，不续终也。虽不当位，刚柔应也。",
            x: "《象》曰：火在水上，未济；君子以慎辨物居方。"
        },
        yao: [ {
            index: 0,
            y: "初六：濡其尾，吝。",
            x: "《象》曰：濡其尾，亦不知极也。"
        }, {
            index: 1,
            y: "九二：曳其轮，贞吉。",
            x: "《象》曰：九二贞吉，中以行正也。"
        }, {
            index: 2,
            y: "六三：未济，征凶，利涉大川。",
            x: "《象》曰：未济征凶，位不当也。"
        }, {
            index: 3,
            y: "九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。",
            x: "《象》曰：贞吉悔亡，志行也。"
        }, {
            index: 4,
            y: "六五：贞吉，无悔，君子之光，有孚，吉。",
            x: "《象》曰：君子之光，其晖吉也。"
        }, {
            index: 5,
            y: "上九：有孚于饮酒，无咎，濡其首，有孚失是。",
            x: "《象》曰：饮酒濡首，亦不知节也。"
        } ]
    };