export const dataList = {
        gua: {
            m: "水火既济",
            y: "既济：亨，小利贞，初吉终乱。",
            t: "《彖》曰：既济亨，小者亨也。利贞，刚柔正而位当也。初吉，柔得中也。终止则乱，其道穷也。",
            x: "《象》曰：水在火上，既济；君子以思患而豫防之。"
        },
        yao: [ {
            index: 0,
            y: "初九：曳其轮，濡其尾，无咎。",
            x: "《象》曰：曳其轮，义无咎也。"
        }, {
            index: 1,
            y: "六二：妇丧其 ，勿逐，七日得。",
            x: "《象》曰：七日得，以中道也。"
        }, {
            index: 2,
            y: "九三：高宗伐鬼方，三年克之，小人勿用。",
            x: "《象》曰：三年克之，惫也。"
        }, {
            index: 3,
            y: "六四： 有衣 ，终日戒。",
            x: "《象》曰：终日戒，有所疑也。"
        }, {
            index: 4,
            y: "九五：东邻杀牛，不如西邻之 祭，实受其福。",
            x: "《象》曰：东邻杀牛，不如西邻之时也。实受其福，吉大来也。"
        }, {
            index: 5,
            y: "上六：濡其首，厉。",
            x: "《象》曰：濡其首厉，何可久也。"
        } ]
    };