export const dataList = {
        gua: {
            m: "水风井",
            y: "井：改邑不改井，无丧无得，往来井井。汔至，亦未 井，羸其瓶，凶。",
            t: "《彖》曰：巽乎水而上水，井。井，养而不穷也。改邑不改井，乃以刚中也。汔至亦未繘井，未有功也。羸其瓶，是以凶也。",
            x: "《象》曰：木上有水，井；君子以劳民劝相。"
        },
        yao: [ {
            index: 0,
            y: "初六：井泥不食，旧井无禽。",
            x: "《象》曰：井泥不食，下也。旧井无禽，时舍也。"
        }, {
            index: 1,
            y: "九二：井谷射鲋，瓮敝漏。",
            x: "《象》曰：井谷射鲋，无与也。"
        }, {
            index: 2,
            y: "九三：井渫不为我民恻，可用汲，王明，并受其福。",
            x: "《象》曰：井渫不食，行恻也。求王明，受福也。"
        }, {
            index: 3,
            y: "六四：井 ，无咎。",
            x: "《象》曰：井甃无咎，修井也。"
        }, {
            index: 4,
            y: "九五：井冽，寒泉食。",
            x: "《象》曰：寒泉之食，中正也。"
        }, {
            index: 5,
            y: "上六：井收勿幕，有孚无吉。",
            x: "《象》曰：元吉在上，大成也。"
        } ]
    };