export const dataList = {
        gua: {
            m: "水雷屯",
            y: "屯：元，亨，利，贞，勿用，有攸往，利建侯。",
            t: "《彖》曰：屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。",
            x: "《象》曰：云雷，屯；君子以经纶。",
            yong: ""
        },
        yao: [ {
            index: 0,
            y: "初九：磐桓；利居贞，利建侯。",
            x: "《象》曰：虽磐桓，志行正也"
        }, {
            index: 1,
            y: "六二：屯如 如，乘马班如。 匪寇婚媾，女子贞不字，十年乃字。",
            x: "《象》曰：以贵下贱大得民也六二之难乘刚也。"
        }, {
            index: 2,
            y: "六三：既鹿无虞，惟入于林中，君子几不如舍，往吝。",
            x: "《象》曰：十年乃字反常也即鹿无虞，以从禽也君子舍之往吝穷也。"
        }, {
            index: 3,
            y: "六四：乘马班如，求婚媾，无不利。",
            x: "《象》曰：求而往，明也。"
        }, {
            index: 4,
            y: "九五：屯其膏，小贞吉，大贞凶。",
            x: "《象》曰：屯其膏，施未光也。"
        }, {
            index: 5,
            y: "上六：乘马班如，泣血涟如。",
            x: "《象》曰：泣血涟如，何可长也。"
        } ]
    };