export const dataList = {
        gua: {
            m: "水泽节",
            y: "节：亨。 苦节不可贞。",
            t: "《彖》曰：节亨，刚柔分而刚得中。苦节不可贞，其道穷也。说以行险，当位以节，中正以通。天地节，而四时成。节以制度，不伤财，不害民。",
            x: "《象》曰：泽上有水，节；君子以制数度，议德行。"
        },
        yao: [ {
            index: 0,
            y: "初九：不出户庭，无咎。",
            x: "《象》曰：不出户庭，知通塞也。"
        }, {
            index: 1,
            y: "九二：不出门庭，凶。",
            x: "《象》曰：不出门庭凶，失时极也。"
        }, {
            index: 2,
            y: "六三：不节若，则嗟若，无咎。",
            x: "《象》曰：不节之嗟，又谁咎也。"
        }, {
            index: 3,
            y: "六四：安节，亨。",
            x: "《象》曰：安节之亨，承上道也。"
        }, {
            index: 4,
            y: "九五：甘节，吉；往有尚。",
            x: "《象》曰：甘节之吉，居位中也。"
        }, {
            index: 5,
            y: "上六：苦节，贞凶，悔亡。",
            x: "《象》曰：苦节贞凶，其道穷也。"
        } ]
    };