export const dataList = {
        gua: {
            m: "水天需",
            y: "需：有孚，光亨，贞吉。利涉大川。",
            t: "《彖》曰：需，须也，险在前也，刚健而不陷，其义不困穷矣。需有孚，光亨贞吉，位乎天位，以正中也。利涉大川，往有功也。",
            x: "《象》曰：云上于天，需；君子以饮食宴乐。",
            yong: ""
        },
        yao: [ {
            index: 0,
            y: "初九：需于郊。 利用恒，无咎。",
            x: "《象》曰：需于郊,不犯难行也。利用恒无咎,未失常也。"
        }, {
            index: 1,
            y: "九二：需于沙。 小有言，终吉。",
            x: "《象》曰：需于沙，衍在中也。虽小有言，以终吉也。"
        }, {
            index: 2,
            y: "九三：需于泥，致寇至。",
            x: "《象》曰：需于泥，灾在外也。自我致寇，敬慎不败也。"
        }, {
            index: 3,
            y: "六四：需于血，出自穴。",
            x: "《象》曰：需于血，顺以听也。"
        }, {
            index: 4,
            y: "九五：需于酒食，贞吉。",
            x: "《象》曰：酒食贞吉，以中正也。"
        }, {
            index: 5,
            y: "上六：入于穴，有不速之客三人来，敬之终吉。",
            x: "《象》曰：不速之客来，敬之终吉。虽不当位未大失也。"
        } ]
    };