export const dataList = {
        gua: {
            m: "水山蹇",
            y: "蹇：利西南，不利东北；利见大人，贞吉。",
            t: "《彖》曰：蹇，难也，险在前也。见险而能止，知矣哉。蹇利西南，往得中也。不利东北，其道穷也。利见大人，往有功也。当位贞吉，以正邦也。蹇之时用大矣哉。",
            x: "《象》曰：山上有水，蹇；君子以反身修德。"
        },
        yao: [ {
            index: 0,
            y: "初六：往蹇，来誉。",
            x: "《象》曰：往蹇来誉，宜待也。"
        }, {
            index: 1,
            y: "六二：王臣蹇蹇，匪躬之故。",
            x: "《象》曰：王臣蹇蹇，终无尤也。"
        }, {
            index: 2,
            y: "九三：往蹇来反。",
            x: "《象》曰：往蹇来反，内喜之也。"
        }, {
            index: 3,
            y: "六四：往蹇来连。",
            x: "《象》曰：往蹇来连，当位实也。"
        }, {
            index: 4,
            y: "九五：大蹇朋来。",
            x: "《象》曰：大蹇朋来，以中节也。"
        }, {
            index: 5,
            y: "上六：往蹇来硕，吉；利见大人。",
            x: "《象》曰：往蹇来硕，志在内也。利见大人，以从贵也。"
        } ]
    };