export const dataList = {
        gua: {
            m: "水地比",
            y: "比：吉。 原筮元永贞，无咎。 不宁方来，后夫凶。",
            t: "《彖》曰：比，吉也；比，辅也。下顺从也。原筮，元永贞，无咎，以刚中也。不宁方来，上下应也。後夫凶，其道穷也。",
            x: "《象》曰：地上有水，比；先王以建万国，亲诸侯。"
        },
        yao: [ {
            index: 0,
            y: "初六：有孚比之，无咎。 有孚盈缶，终来有他，吉。",
            x: "《象》曰：比之初六，有它吉也。"
        }, {
            index: 1,
            y: "六二：比之自内，贞吉。",
            x: "《象》曰：比之自内，不自失也。"
        }, {
            index: 2,
            y: "六三：比之匪人。",
            x: "《象》曰：比之匪人，不亦伤乎。"
        }, {
            index: 3,
            y: "六四：外比之，贞吉。",
            x: "《象》曰：外比于贤，以从上也。"
        }, {
            index: 4,
            y: "九五：显比，王用三驱，失前禽。 邑人不诫，吉。",
            x: "《象》曰：显比之吉，位正中也。舍逆取顺，失前禽也。邑人不诫，上使中也。"
        }, {
            index: 5,
            y: "上六：比之无首，凶。",
            x: "《象》曰：比之无首，无所终也。"
        } ]
    };