export const dataList = {
        gua: {
            m: "天山遁",
            y: "遯：亨，小利贞。",
            t: "《彖》曰：遯亨，遯而亨也。刚当位而应，与时行也。小利贞，浸而长也。遯之时义大矣哉。",
            x: "《象》曰：天下有山，遯；君子以远小人，不恶而严。"
        },
        yao: [ {
            index: 0,
            y: "初六：遁尾，厉，勿用有攸往。",
            x: "《象》曰：遯尾之厉，不往何灾也。"
        }, {
            index: 1,
            y: "六二：执之用黄牛之革，莫之胜说",
            x: "《象》曰：执用黄牛，固志也。"
        }, {
            index: 2,
            y: "九三：系遁，有疾厉，畜臣妾吉。",
            x: "《象》曰：系遯之厉，有疾惫也。畜臣妾吉，不可大事也。"
        }, {
            index: 3,
            y: "九四：好遁，君子吉，小人否。",
            x: "《象》曰：君子好遯，小人否也。"
        }, {
            index: 4,
            y: "九五：嘉遁，贞吉。",
            x: "《象》曰：嘉遯贞吉，以正志也。"
        }, {
            index: 5,
            y: "上九：肥遁，无不利。",
            x: "《象》曰：肥遯无不利，无所疑也。"
        } ]
    };