export const dataList = {
        gua: {
            m: "天雷无妄",
            y: "无妄：元，亨，利，贞。 其匪正有眚，不利有攸往。",
            t: "《彖》曰：无妄，刚自外来，而为主於内。动而健，刚中而应，大亨以正，天之命也。其匪正有眚，不利有攸往，无妄之往，何之矣。天命不佑，行矣哉。",
            x: "《象》曰：天下雷行，物与无妄；先王以茂对时育万物。"
        },
        yao: [ {
            index: 0,
            y: "初九：无妄往，吉。",
            x: "《象》曰：无妄之往，得志也。"
        }, {
            index: 1,
            y: "六二：不耕获，不菑畬，则利用攸往。",
            x: "《象》曰：不耕获，未富也。"
        }, {
            index: 2,
            y: "六三：无妄之灾，或系之牛，行人之得，邑人之灾。",
            x: "《象》曰：行人得牛，邑人灾也。"
        }, {
            index: 3,
            y: "九四：可贞，无咎。",
            x: "《象》曰：可贞无咎，固有之也。"
        }, {
            index: 4,
            y: "九五：无妄之疾，勿药有喜。",
            x: "《象》曰：无妄之药，不可试也。"
        }, {
            index: 5,
            y: "上九：无妄，行有眚，无攸利。",
            x: "《象》曰：无妄之行，穷之灾也。"
        } ]
    };