export const dataList = {
        gua: {
            m: "天泽履",
            y: "履：履虎尾，不咥人。亨。",
            t: "《彖》曰：“履”，柔履刚也。说而应乎乾，是以“履虎尾，不咥人”。亨，刚中正，履帝位而不疚，光明也。",
            x: "《象》曰：上天下泽，“履”。君子以辨上下，定民志。"
        },
        yao: [ {
            index: 0,
            y: "初九：素履往，无咎。",
            x: "《象》曰：“素履之往”，独行愿也。"
        }, {
            index: 1,
            y: "九二：履道坦坦，幽人贞吉。",
            x: "《象》曰：幽人贞吉，中不自乱也。"
        }, {
            index: 2,
            y: "六三：眇能视，跛能履，履虎尾，咥人，凶。武人为于大君。",
            x: "《象》曰：“眇能视”，不足以有明也。“跛能履”，不足以与行也。“咥人之凶”，位不当也。“武人为于大君”，志刚也。"
        }, {
            index: 3,
            y: "九四：履虎尾，愬愬，终吉。",
            x: "《象》曰：愬愬终吉，志行也。"
        }, {
            index: 4,
            y: "九五：夬履，贞厉。",
            x: "《象》曰：夬履贞厉，位正当也。"
        }, {
            index: 5,
            y: "上九：视履考祥，其旋元吉。",
            x: "《象》曰：元吉在上，大有庆也。"
        } ]
    };