export const dataList = {
        gua: {
            m: "天水讼",
            y: "讼：有孚，窒。惕中吉。终凶。利见大人，不利涉大川。",
            t: "《彖》曰：讼，上刚下险，险而健，讼。讼，有孚、窒、惕、中吉，刚来而得中也。终凶，讼不可成也。利见大人，尚中正也。不利涉大川，入于渊也。",
            x: "《象》曰：天与水违行，讼；君子以作事谋始。",
            yong: ""
        },
        yao: [ {
            index: 0,
            y: "初六：不永所事，小有言，终吉。",
            x: "《象》曰：不永所事，讼不可长也。虽小有言，其辩明也。"
        }, {
            index: 1,
            y: "九二：不克讼，归而逋，其邑人三百户，无眚。",
            x: "《象》曰：不克讼，归逋窜也。自下讼上，患至掇也。"
        }, {
            index: 2,
            y: "六三：食旧德，贞厉，终吉，或从王事，无成。",
            x: "《象》曰：食旧德，从上吉也。"
        }, {
            index: 3,
            y: "九四：不克讼， 自命，渝安贞，吉。",
            x: "《象》曰：复即命渝，安贞不失也。"
        }, {
            index: 4,
            y: "九五：讼元吉。",
            x: "《象》曰：讼元吉，以中正也。"
        }, {
            index: 5,
            y: "上九：或锡之 带，终朝三褫之。",
            x: "《象》曰：以讼受服，亦不足敬也。"
        } ]
    };