export const dataList = {
        gua: {
            m: "火天大有",
            y: "大有：元亨。",
            t: "《彖》曰：大有，柔得尊位，大中而上下应之，曰大有。其德刚健而文明，应乎天而时行，是以元亨。",
            x: "《象》曰：火在天上，大有；君子以遏恶扬善，顺天休命。"
        },
        yao: [ {
            index: 0,
            y: "初九：无交害，匪咎，艰则无咎。",
            x: "《象》曰：大有初九，无交害也。"
        }, {
            index: 1,
            y: "九二：大车以载，有攸往，无咎。",
            x: "《象》曰：大车以载，积中不败也。"
        }, {
            index: 2,
            y: "九三：公用亨于天子，小人弗克。",
            x: "《象》曰：公用亨于天子，小人害也。"
        }, {
            index: 3,
            y: "九四：匪其彭，无咎。",
            x: "《象》曰：匪其彭无咎，明辨皙也。"
        }, {
            index: 4,
            y: "六五：厥孚交如，威如，吉。",
            x: "《象》曰：厥孚交如信以发志也。威如之吉，易而无备也。"
        }, {
            index: 5,
            y: "上九：自天佑之，吉无不利。",
            x: "《象》曰：大有上吉，自天祐也。"
        } ]
    };