export const dataList = {
        gua: {
            m: "天火同人",
            y: "同人：同人于野，亨。 利涉大川，利君子贞。",
            t: "《彖》曰：同人，柔得位得中，而应乎乾，曰同人。同人曰「同人于野，亨。利涉大川。」乾行也。文明以健，中正而应，君子正也。唯君子为能通天下之志。",
            x: "《象》曰：天与火，同人；君子以类族辨物。"
        },
        yao: [ {
            index: 0,
            y: "初九：同人于门，无咎。",
            x: "《象》曰：出门同人，又谁咎也。"
        }, {
            index: 1,
            y: "六二：同人于宗，吝。",
            x: "《象》曰：同人于宗，吝道也。"
        }, {
            index: 2,
            y: "九三：伏戎于莽，升其高陵，三岁不兴。",
            x: "《象》曰：伏戎于莽，敌刚也三岁不兴，安行也。"
        }, {
            index: 3,
            y: "九四：乘其墉，弗克攻，吉。",
            x: "《象》曰：乘其墉，义弗克也。其吉，则困而反则也。"
        }, {
            index: 4,
            y: "九五：同人，先号啕而后笑。 大师克相遇。",
            x: "《象》曰：同人之先，以中直也。大师相遇，言相克也。"
        }, {
            index: 5,
            y: "上九：同人于郊，无悔。",
            x: "《象》曰：同人于郊，志未得也。"
        } ]
    };