export const dataList = {
        gua: {
            m: "天风姤",
            y: "姤：女壮，勿用取女。",
            t: "《彖》曰：姤，遇也，柔遇刚也。勿用取女，不可与长也。天地相遇，品物咸章也。刚遇中正，天下大行也。姤之时义大矣哉。",
            x: "《象》曰：天下有风，姤；后以施命诰四方。"
        },
        yao: [ {
            index: 0,
            y: "初六：系于金 ，贞吉，有攸往，见凶，羸豕踟躅。",
            x: "《象》曰：系于金柅，柔道牵也。"
        }, {
            index: 1,
            y: "九二：包有鱼，无咎，不利宾。",
            x: "《象》曰：包有鱼，义不及宾也。"
        }, {
            index: 2,
            y: "九三：臀无肤，其行次且，厉，无大咎。",
            x: "《象》曰：其行次且，行未牵也。"
        }, {
            index: 3,
            y: "九四：包无鱼，起凶。",
            x: "《象》曰：无鱼之凶，远民也。"
        }, {
            index: 4,
            y: "九五：以杞包瓜，含章，有陨自天。",
            x: "《象》曰：九五含章，中正也。有陨自天，志不舍命也。"
        }, {
            index: 5,
            y: "上九：姤其角，吝，无咎。",
            x: "《象》曰：姤其角，上穷吝也。"
        } ]
    };