export const dataList = {
        gua: {
            m: "天地否",
            y: "否：否之匪人，不利君子贞，大往小来。",
            t: "《彖》曰：否之匪人，不利君子贞，大往小来。则是天地不交而万物不通也，上下不交而天下无邦也。内阴而外阳，内柔而外刚，内小人而外君子。小人道长，君子道消也。",
            x: "《象》曰：天地不交，否；君子以俭德辟难，不可荣以禄。"
        },
        yao: [ {
            index: 0,
            y: "初六：拔茅茹，以其夤，贞吉亨。",
            x: "《象》曰：拔茅贞吉，志在君也。"
        }, {
            index: 1,
            y: "六二：包承。 小人吉，大人否亨。",
            x: "《象》曰：大人否亨，不乱群也。"
        }, {
            index: 2,
            y: "六三：包羞。",
            x: "《象》曰：包羞，位不当也。"
        }, {
            index: 3,
            y: "九四：有命无咎，畴离祉。",
            x: "《象》曰：有命无咎，志行也。"
        }, {
            index: 4,
            y: "九五：休否，大人吉。 其亡其亡，系于苞桑。",
            x: "《象》曰：大人之吉，位正当也。"
        }, {
            index: 5,
            y: "上九：倾否，先否后喜。",
            x: "《象》曰：否终则倾，何可长也。"
        } ]
    };