export const dataList = {
        gua: {
            m: "巽为风",
            y: "巽：小亨，利攸往，利见大人。",
            t: "《彖》曰：重巽以申命，刚巽乎中正而志行。柔皆顺乎刚，是以小亨，利有攸往，利见大人。",
            x: "《象》曰：随风，巽；君子以申命行事。"
        },
        yao: [ {
            index: 0,
            y: "初六：进退，利武人之贞。",
            x: "《象》曰：进退，志疑也。利武人之贞，志治也。"
        }, {
            index: 1,
            y: "九二：巽在床下，用史巫纷若，吉无咎。",
            x: "《象》曰：纷若之吉，得中也。"
        }, {
            index: 2,
            y: "九三：频巽，吝。",
            x: "《象》曰：频巽之吝，志穷也。"
        }, {
            index: 3,
            y: "六四：悔亡，田获三品。",
            x: "《象》曰：田获三品，有功也。"
        }, {
            index: 4,
            y: "九五：贞吉悔亡，无不利。 无初有终，先庚三日，后庚三日，吉。",
            x: "《象》曰：九五之吉，位正中也。"
        }, {
            index: 5,
            y: "上九：巽在床下，丧其资斧，贞凶。",
            x: "《象》曰：巽在床下，上穷也。丧其资斧，正乎凶也。"
        } ]
    };