export const dataList = {
        gua: {
            m: "泽风大过",
            y: "大过：栋桡，利有攸往，亨。",
            t: "《彖》曰：大过，大者过也。栋桡，本末弱也。刚过而中，巽而说行，利有攸往，乃亨。大过之时大矣哉。",
            x: "《象》曰：泽灭木，大过；君子以独立不惧，遁世无闷。"
        },
        yao: [ {
            index: 0,
            y: "初六：藉用白茅，无咎。",
            x: "《象》曰：藉用白茅，柔在下也。"
        }, {
            index: 1,
            y: "九二：枯杨生 ，老夫得其女妻，无不利。",
            x: "《象》曰：老夫女妻，过以相与也。"
        }, {
            index: 2,
            y: "九三：栋桡，凶。",
            x: "《象》曰：栋桡之凶，不可以有辅也。"
        }, {
            index: 3,
            y: "九四：栋隆，吉；有它吝。",
            x: "《象》曰：栋隆之吉，不桡乎下也。"
        }, {
            index: 4,
            y: "九五：枯杨生华，老妇得士夫，无咎无誉。",
            x: "《象》曰：枯杨生华，何可久也。无妇士夫，亦可丑也。"
        }, {
            index: 5,
            y: "上六：过涉灭顶，凶，无咎。",
            x: "《象》曰：过涉之凶，不可咎也。"
        } ]
    };