export const dataList = {
        gua: {
            m: "泽火革",
            y: "革：巳日乃孚，元亨利贞，悔亡。",
            t: "《彖》曰：革，水火相息，二女同居，其志不相得，曰革。巳日乃孚，革而信之。文明以说，大亨以正。革而当，其悔乃亡。天地革，而四时成。汤武革命，顺乎天而应乎人。革之时大矣哉。",
            x: "《象》曰：泽中有火，革；君子以治历明时。"
        },
        yao: [ {
            index: 0,
            y: "初九：巩用黄牛之革。",
            x: "《象》曰：巩用黄牛，不可以有为也。"
        }, {
            index: 1,
            y: "六二：巳日乃革之，征吉，无咎。",
            x: "《象》曰：巳日革之，行有嘉也。"
        }, {
            index: 2,
            y: "九三：征凶，贞厉，革言三就，有孚。",
            x: "《象》曰：革言三就，又何之矣。"
        }, {
            index: 3,
            y: "九四：悔亡，有孚改命，吉。",
            x: "《象》曰：改命之吉，信志也。"
        }, {
            index: 4,
            y: "九五：大人虎变，未占有孚。",
            x: "《象》曰：大人虎变，其文炳也。"
        }, {
            index: 5,
            y: "上六：君子豹变，小人革面，征凶，居贞吉。",
            x: "《象》曰：君子豹变，其文蔚也。小人革面，顺以从君也。"
        } ]
    };