export const dataList = {
        gua: {
            m: "泽雷随",
            y: "随：元亨利贞，无咎。",
            t: "《彖》曰：随，刚来而下柔，动而说，随。大亨贞无咎，而天下随时。随时之义大矣哉。",
            x: "《象》曰：泽中有雷，随；君子以向晦入宴息。"
        },
        yao: [ {
            index: 0,
            y: "初九：官有渝，贞吉。 出门交有功。",
            x: "《象》曰：官有渝，从正吉也。"
        }, {
            index: 1,
            y: "六二：系小子，失丈夫。",
            x: "《象》曰：出门交有功，不失也。"
        }, {
            index: 2,
            y: "六三：系丈夫，失小子。 随有求得，利居贞。",
            x: "《象》曰：系小子，弗兼与也。系丈夫，志舍下也。随有获，其义凶也。"
        }, {
            index: 3,
            y: "九四：随有获，贞凶。有孚在道，以明，何咎。",
            x: "《象》曰：有孚在道，明功也。"
        }, {
            index: 4,
            y: "九五：孚于嘉，吉。",
            x: "《象》曰：孚于嘉吉，位正中也。"
        }, {
            index: 5,
            y: "上六：拘系之，乃从维之。王用亨于西山。",
            x: "《象》曰：拘系之，上穷也。"
        } ]
    };