export const dataList = {
        gua: {
            m: "泽山咸",
            y: "咸：亨，利贞，取女吉。",
            t: "《彖》曰：咸，感也。柔上而刚下，二气感应以相与。止而说，男下女，是以亨利贞，取女吉也。天地感而万物化生，圣人感人心而天下和平。观其所感，而天地万物之情可见矣。。",
            x: "《象》曰：山上有泽，咸；君子以虚受人。"
        },
        yao: [ {
            index: 0,
            y: "初六：咸其拇。",
            x: "《象》曰：咸其拇，志在外也。"
        }, {
            index: 1,
            y: "六二：咸其腓，凶，居吉。",
            x: "《象》曰：虽凶居吉，顺不害也。"
        }, {
            index: 2,
            y: "九三：咸其股，执其随，往吝。",
            x: "《象》曰：咸其股，亦不处也。志在随人，所执下也。"
        }, {
            index: 3,
            y: "九四：贞吉悔亡，憧憧往来，朋从尔思。",
            x: "《象》曰：贞吉悔亡，未感害也。憧憧往来，未光大也。"
        }, {
            index: 4,
            y: "九五：咸其 ，无悔。",
            x: "《象》曰：咸其脢，志末也。"
        }, {
            index: 5,
            y: "上六：咸其辅，颊，舌。",
            x: "《象》曰：咸其辅颊舌，滕口说也。"
        } ]
    };