export const dataList = {
        gua: {
            m: "泽水困",
            y: "困：亨，贞，大人吉，无咎，有言不信。",
            t: "《彖》曰：困，刚揜也。险以说，困而不失其所亨，其唯君子乎。贞大人吉，以刚中也。有言不信，尚口乃穷也。",
            x: "《象》曰：泽无水，困；君子以致命遂志。"
        },
        yao: [ {
            index: 0,
            y: "初六：臀困于株木，入于幽谷，三岁不见。",
            x: "《象》曰：入于幽谷，幽不明也。"
        }, {
            index: 1,
            y: "九二：困于酒食，朱绂方来，利用亨祀，征凶，无咎。",
            x: "《象》曰：困于酒食，中有庆也。"
        }, {
            index: 2,
            y: "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。",
            x: "《象》曰：据于蒺藜，乘刚也。入于其宫不见其妻，不祥也。"
        }, {
            index: 3,
            y: "九四：来徐徐，困于金车，吝，有终。",
            x: "《象》曰：来徐徐，志在下也。虽不当位，有与也。"
        }, {
            index: 4,
            y: "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。",
            x: "《象》曰：劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。"
        }, {
            index: 5,
            y: "上六：困于葛 ，于 ，曰动悔。 有悔，征吉。",
            x: "《象》曰：困于葛藟，未当也。动悔有悔，吉行也。"
        } ]
    };