export const dataList = {
        gua: {
            m: "泽天夬",
            y: "夬：扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往。",
            t: "《彖》曰：夬，决也，刚决柔也。健而说，决而和。扬于王庭，柔乘五刚也。孚号有厉，其危乃光也。告自邑不利即戎，所尚乃穷也。利有攸往，刚长乃终也。",
            x: "《象》曰：泽上于天，夬；君子以施禄及下，居德则忌。"
        },
        yao: [ {
            index: 0,
            y: "初九：壮于前趾，往不胜为吝。",
            x: "《象》曰：不胜而往，咎也。"
        }, {
            index: 1,
            y: "九二：惕号，莫夜有戎，勿恤。",
            x: "《象》曰：有戎勿恤，得中道也。"
        }, {
            index: 2,
            y: "九三：壮于頄，有凶。 君子夬夬，独行遇雨，若濡有愠，无咎。",
            x: "《象》曰：君子夬夬，终无咎也。"
        }, {
            index: 3,
            y: "九四：臀无肤，其行次且。 牵羊悔亡，闻言不信。",
            x: "《象》曰：其行次且，位不当也。闻言不信，聪不明也。"
        }, {
            index: 4,
            y: "九五：苋陆夬夬，中行无咎。",
            x: "《象》曰：中行无咎，中未光也。"
        }, {
            index: 5,
            y: "上六：无号，终有凶。",
            x: "《象》曰：无号之凶，终不可长也。"
        } ]
    };