export const dataList = {
        gua: {
            m: "震为雷",
            y: "震：亨。 震来 ，笑言哑哑。 震惊百里，不丧匕鬯。",
            t: "《彖》曰：震亨，震来虩虩，恐致福也。笑言哑哑，后有则也。震惊百里，惊远而惧迩也。[不丧匕鬯]，出可以守宗庙社稷，以为祭主也。",
            x: "《象》曰：洊雷，震；君子以恐惧修省。"
        },
        yao: [ {
            index: 0,
            y: "初九：震来 ，后笑言哑哑，吉。",
            x: "《象》曰：震来虩虩，恐致福也。笑言哑哑，后有则也。"
        }, {
            index: 1,
            y: "六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。",
            x: "《象》曰：震来厉，乘刚也。"
        }, {
            index: 2,
            y: "六三：震苏苏，震行无眚。",
            x: "《象》曰：震苏苏，位不当也。。"
        }, {
            index: 3,
            y: "九四：震遂泥。",
            x: "《象》曰：震遂泥，未光也。"
        }, {
            index: 4,
            y: "六五：震往来厉，亿无丧，有事。",
            x: "《象》曰：震往来厉，危行也。其事在中，大无丧也。"
        }, {
            index: 5,
            y: "上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。 婚媾有言。",
            x: "《象》曰：震索索，中未得也。虽凶无咎，畏邻戒也。"
        } ]
    };